[
    {
        "rukus":[
            {
            "ruku":1,
            "arabic": "١. بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n٢. الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ\n٣. الرَّحْمَٰنِ الرَّحِيمِ\n٤. مَالِكِ يَوْمِ الدِّينِ\n٥. إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ\n٦. اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ\n٧. صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
            "translation": "1. In the name of Allah, the Most Gracious, the Most Merciful.\n2. All praise belongs to Allah, Lord of the worlds.\n3. The Most Gracious, the Most Merciful.\n4. Master of the Day of Judgment.\n5. You alone do we worship and You alone do we ask for help.\n6. Guide us on the Straight Path.\n7. The path of those who have received Your grace; not the path of those who have brought down wrath upon themselves, nor of those who have gone astray.",
            "arabic_recitation": "https://server.mp3quran.net/afs/001.mp3",
            "tafseer_audio": "https://example.com/tafsir/1.mp3",
            "tafseer_video": "https://youtube.com/watch?v=tafsir-fatiha"
            }
        ]
    },
    {
        "rukus":[
            { 
                "ruku": 1,
                "arabic": "١. الم\n٢. ذَٰلِكَ الْكِتَابُ لَا رَيْبَ فِيهِ هُدًى لِّلْمُتَّقِينَ\n٣. الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ\n٤. وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ\n٥. أُو۟لَـٰٓئِكَ عَلَىٰ هُدًۭى مِّن رَّبِّهِمْ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ\n٦. إِنَّ ٱلَّذِينَ كَفَرُوا۟ سَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ\n٧. خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ وَعَلَىٰٓ أَبْصَـٰرِهِمْ غِشَـٰوَةٌۭ وَلَهُمْ عَذَابٌ عَظِيمٌۭ",
                "translation": "1. Alif, Lam, Meem.\n2. This is the Book; there is no doubt in it. It is a guide for the righteous.\n3. Those who believe in the unseen and establish prayer and spend out of what We have provided for them.\n4. And who believe in what has been revealed to you [O Muhammad], and what was revealed before you, and they have firm faith in the Hereafter.\n5. It is they who are on guidance from their Lord, and they are the successful.\n6. Surely, those who have disbelieved, it is all the same for them whether you warn them or do not warn them; they will not believe.\n7. Allah has set a seal upon their hearts and upon their hearing, and over their eyes is a covering. And for them is a mighty punishment.",
                "arabic_recitation": "https://server.mp3quran.net/afs/002.mp3",
                "tafseer_audio": "https://example.com/tafsir/2.mp3",
                "tafseer_video": "https://cc-quran-tafseer.s3.ap-southeast-2.amazonaws.com/quran/videos/Surah-1/1.mp4"
              },
               { 
                 "ruku" : 2,
                "arabic": "٨. وَمِنَ النَّاسِ مَن يَقُولُ آمَنَّا بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ وَمَا هُم بِمُؤْمِنِينَ\n٩. يُخَادِعُونَ اللَّهَ وَالَّذِينَ آمَنُوا وَمَا يَخْدَعُونَ إِلَّا أَنفُسَهُمْ وَمَا يَشْعُرُونَ\n١٠. فِي قُلُوبِهِم مَّرَضٌ فَزَادَهُمُ اللَّهُ مَرَضًا وَلَهُمْ عَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْذِبُونَ\n١١. وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا فِي الْأَرْضِ قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ\n١٢. أَلَا إِنَّهُمْ هُمُ الْمُفْسِدُونَ وَلَٰكِن لَا يَشْعُرُونَ\n١٣. وَإِذَا قِيلَ لَهُمْ آمِنُوا كَمَا آمَنَ النَّاسُ قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاءُ أَلَا إِنَّهُمْ هُمُ السُّفَهَاءُ وَلَٰكِن لَا يَعْلَمُونَ\n١٤. وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَوْا إِلَىٰ شَيَاطِينِهِمْ قَالُوا إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِئُونَ\n١٥. اللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ\n١٦. أُو۟لَٰٓئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَىٰ فَمَا رَبِحَت تِّجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ\n١٧. مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ ذَهَبَ اللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِي ظُلُمَاتٍ لَا يُبْصِرُونَ\n١٨. صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ\n١٩. أَوْ كَصَيِّبٍ مِّنَ السَّمَاءِ فِيهِ ظُلُمَاتٌ وَرَعْدٌ وَبَرْقٌ يَجْعَلُونَ أَصَابِعَهُمْ فِي آذَانِهِم مِّنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِ وَاللَّهُ مُحِيطٌ بِالْكَافِرِينَ\n٢٠. يَكَادُ الْبَرْقُ يَخْطَفُ أَبْصَارَهُمْ كُلَّمَا أَضَاءَ لَهُم مَّشَوْا فِيهِ وَإِذَا أَظْلَمَ عَلَيْهِمْ قَامُوا وَلَوْ شَاءَ اللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَارِهِمْ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
                "translation": "8. And among people are those who say, “We believe in Allah and in the Last Day,” yet they are not believers.\n9. They [think to] deceive Allah and those who believe, but they deceive not except themselves and perceive [it] not.\n10. In their hearts is a disease, so Allah has increased their disease; and for them is a painful punishment because they [habitually] used to lie.\n11. And when it is said to them, “Do not cause corruption on the earth,” they say, “We are only reformers.”\n12. Unquestionably, it is they who are the corrupters, but they perceive [it] not.\n13. And when it is said to them, “Believe as the people have believed,” they say, “Should we believe as the foolish have believed?” Unquestionably, it is they who are the foolish, but they know [it] not.\n14. And when they meet those who believe, they say, “We believe”; but when they are alone with their evil ones, they say, “Indeed, we are with you; we were only mockers.”\n15. [But] Allah mocks them and prolongs them in their transgression [while] they wander blindly.\n16. Those are the ones who have purchased error [in exchange] for guidance, so their transaction has brought no profit, nor were they guided.\n17. Their example is that of one who kindled a fire, but when it illuminated what was around him, Allah took away their light and left them in darkness [so] they could not see.\n18. Deaf, dumb and blind - so they will not return [to the right path].\n19. Or [their deeds are] like a rainstorm from the sky, wherein is darkness, thunder and lightning. They put their fingers in their ears against the thunderclaps in dread of death. But Allah is encompassing of the disbelievers.\n20. The lightning almost snatches away their sight. Whenever it lights [the way] for them, they walk therein; but when darkness comes over them, they stand [still]. And if Allah had willed, He could have taken away their hearing and their sight. Indeed, Allah is over all things competent.",
                "arabic_recitation": "https://server.mp3quran.net/afs/002.mp3",
                "tafseer_audio": "https://example.com/tafsir/3.mp3",
                "tafseer_video": "https://youtube.com/watch?v=tafsir-baqarah2"
              },
              {  "ruku": 3,
                "arabic": "٢١. يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ\n٢٢. الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً وَأَنزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَّكُمْ فَلَا تَجْعَلُوا لِلَّهِ أَندَادًا وَأَنتُمْ تَعْلَمُونَ\n٢٣. وَإِن كُنتُمْ فِي رَيْبٍ مِّمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا بِسُورَةٍ مِّن مِّثْلِهِ وَادْعُوا شُهَدَاءَكُم مِّن دُونِ اللَّهِ إِن كُنتُمْ صَادِقِينَ\n٢٤. فَإِن لَّمْ تَفْعَلُوا وَلَن تَفْعَلُوا فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ أُعِدَّتْ لِلْكَافِرِينَ\n٢٥. وَبَشِّرِ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ كُلَّمَا رُزِقُوا مِنْهَا مِن ثَمَرَةٍ رِّزْقًا قَالُوا هَٰذَا الَّذِي رُزِقْنَا مِن قَبْلُ وَأُتُوا بِهِ مُتَشَابِهًا وَلَهُمْ فِيهَا أَزْوَاجٌ مُّطَهَّرَةٌ وَهُمْ فِيهَا خَالِدُونَ\n٢٦. إِنَّ اللَّهَ لَا يَسْتَحْيِي أَن يَضْرِبَ مَثَلًا مَّا بَعُوضَةً فَمَا فَوْقَهَا فَأَمَّا الَّذِينَ آمَنُوا فَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِن رَّبِّهِمْ وَأَمَّا الَّذِينَ كَفَرُوا فَيَقُولُونَ مَاذَا أَرَادَ اللَّهُ بِهَٰذَا مَثَلًا يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا وَمَا يُضِلُّ بِهِ إِلَّا الْفَاسِقِينَ\n٢٧. الَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ\n٢٨. كَيْفَ تَكْفُرُونَ بِاللَّهِ وَكُنتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ\n٢٩. هُوَ الَّذِي خَلَقَ لَكُم مَّا فِي الْأَرْضِ جَمِيعًا ثُمَّ اسْتَوَىٰ إِلَى السَّمَاءِ فَسَوَّاهُنَّ سَبْعَ سَمَاوَاتٍ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ",
                "translation": "21. O mankind! Worship your Lord who created you and those before you, so that you may become God-fearing.\n22. He who made the earth a bed for you and the sky a canopy, and sent down water from the sky, then brought forth with it fruits as a provision for you. So do not set up equals with Allah while you know [that there is nothing like Him].\n23. And if you are in doubt about what We have sent down upon Our servant [Muhammad], then produce a surah like it and call your witnesses besides Allah if you are truthful.\n24. But if you do not – and you will never be able to – then fear the Fire, whose fuel is men and stones, prepared for the disbelievers.\n25. And give glad tidings to those who believe and do righteous deeds, that they will have gardens beneath which rivers flow. Whenever they are provided with a fruit therefrom, they will say, “This is what we were provided with before,” and it is given to them in likeness. And they will have therein purified spouses, and they will abide therein eternally.\n26. Surely Allah is not ashamed to set forth a parable – even of a mosquito or anything above it. As for those who believe, they know that it is the truth from their Lord. But as for those who disbelieve, they say, “What did Allah intend by this as a parable?” He misleads many thereby and guides many thereby. And He misleads none except the defiantly disobedient.\n27. Those who break the covenant of Allah after ratifying it and sever what Allah has commanded to be joined and make corruption in the earth. It is those who are the losers.\n28. How can you disbelieve in Allah when you were lifeless and He gave you life; then He will cause you to die, then bring you [back] to life, and then to Him you will be returned.\n29. He is the One who created for you all that is in the earth. Then He turned to the heaven and fashioned them into seven heavens, and He has perfect knowledge of all things.",
                "arabic_recitation": "https://server.mp3quran.net/afs/002.mp3",
                "tafseer_audio": "https://example.com/tafsir/4.mp3",
                "tafseer_video": "https://youtube.com/watch?v=tafsir-baqarah3"
              },
              { "ruku": 4,
                "arabic": "٣٠. وَإِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً ۖ قَالُوا أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ قَالَ إِنِّي أَعْلَمُ مَا لَا تَعْلَمُونَ\n٣١. وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا ثُمَّ عَرَضَهُمْ عَلَى الْمَلَائِكَةِ فَقَالَ أَنبِئُونِي بِأَسْمَاءِ هَٰؤُلَاءِ إِن كُنتُمْ صَادِقِينَ\n٣٢. قَالُوا سُبْحَانَكَ لَا عِلْمَ لَنَا إِلَّا مَا عَلَّمْتَنَا إِنَّكَ أَنتَ الْعَلِيمُ الْحَكِيمُ\n٣٣. قَالَ يَا آدَمُ أَنبِئْهُم بِأَسْمَائِهِمْ فَلَمَّا أَنبَأَهُم بِأَسْمَائِهِمْ قَالَ أَلَمْ أَقُل لَّكُمْ إِنِّي أَعْلَمُ غَيْبَ السَّمَاوَاتِ وَالْأَرْضِ وَأَعْلَمُ مَا تُبْدُونَ وَمَا كُنتُمْ تَكْتُمُونَ\n٣٤. وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ أَبَى وَاسْتَكْبَرَ وَكَانَ مِنَ الْكَافِرِينَ\n٣٥. وَقُلْنَا يَا آدَمُ اسْكُنْ أَنتَ وَزَوْجُكَ الْجَنَّةَ وَكُلَا مِنْهَا رَغَدًا حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَٰذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ\n٣٦. فَأَزَلَّهُمَا الشَّيْطَانُ عَنْهَا فَأَخْرَجَهُمَا مِمَّا كَانَا فِيهِ وَقُلْنَا اهْبِطُوا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ وَلَكُمْ فِي الْأَرْضِ مُسْتَقَرٌّ وَمَتَاعٌ إِلَىٰ حِينٍ\n٣٧. فَتَلَقَّىٰ آدَمُ مِن رَّبِّهِ كَلِمَاتٍ فَتَابَ عَلَيْهِ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ\n٣٨. قُلْنَا اهْبِطُوا مِنْهَا جَمِيعًا فَإِمَّا يَأْتِيَنَّكُم مِّنِّي هُدًى فَمَن تَبِعَ هُدَايَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ\n٣٩. وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُو۟لَٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ هُمْ فِيهَا خَـٰلِدُونَ",
                "translation": "30. And when your Lord said to the angels, 'I am going to place a vicegerent on earth.' They said, 'Will You place therein one who will spread corruption and shed blood, while we glorify You with Your praise and declare Your holiness?' He said, 'I know what you do not know.'\n31. And He taught Adam the names, all of them; then He presented them to the angels and said, 'Tell Me the names of these if you are truthful.'\n32. They said, 'Glory be to You! We have no knowledge except what You have taught us. Surely, You are the All-Knowing, All-Wise.'\n33. He said, 'O Adam, tell them their names.' And when he had told them their names, He said, 'Did I not say to you that I know the unseen [aspects] of the heavens and the earth? And I know what you reveal and what you conceal.'\n34. And when We said to the angels, 'Prostrate before Adam,' they prostrated, except for Iblis. He refused and was arrogant and became of the disbelievers.\n35. And We said, 'O Adam, dwell, you and your wife, in Paradise and eat from it in [ease and] abundance from wherever you will. But do not approach this tree, lest you be among the wrongdoers.'\n36. But Satan caused them to slip out of it and removed them from that [condition] in which they had been. And We said, 'Go down, [all of you], as enemies to one another, and you will have upon the earth a place of settlement and provision for a time.'\n37. Then Adam received from his Lord [some] words, and He accepted his repentance. Indeed, it is He who is the Accepting of repentance, the Merciful.\n38. We said, 'Go down from it, all of you. And when guidance comes to you from Me, whoever follows My guidance – there will be no fear concerning them, nor will they grieve.'\n39. But those who disbelieve and deny Our signs – those will be companions of the Fire; they will abide therein eternally.",
                "arabic_recitation": "https://server.mp3quran.net/afs/002.mp3",
                "tafseer_audio": "https://example.com/tafsir/5.mp3",
                "tafseer_video": "https://youtube.com/watch?v=tafsir-baqarah4"
              },
              {   "ruku": 5,
                  "arabic": "٤٠. يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ وَإِيَّايَ فَارْهَبُونِ\n٤١. وَآمِنُوا بِمَا أَنْزَلْتُ مُصَدِّقًا لِمَا مَعَكُمْ وَلَا تَكُونُوا أَوَّلَ كَافِرٍ بِهِ وَلَا تَشْتَرُوا بِآيَاتِي ثَمَنًا قَلِيلًا وَإِيَّايَ فَاتَّقُونِ\n٤٢. وَلَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُوا الْحَقَّ وَأَنْتُمْ تَعْلَمُونَ\n٤٣. وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَارْكَعُوا مَعَ الرَّاكِعِينَ\n٤٤. أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنْتُمْ تَتْلُونَ الْكِتَابَ أَفَلَا تَعْقِلُونَ\n٤٥. وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ\n٤٦. الَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ",
                  "translation": "40. O Children of Israel, remember My favor that I have bestowed upon you, and fulfill My covenant, I will fulfill your covenant, and fear only Me.\n41. And believe in what I have sent down confirming what is with you, and do not be the first to disbelieve in it, and do not exchange My verses for a small price, and fear only Me.\n42. And do not mix the truth with falsehood or conceal the truth while you know [it].\n43. And establish prayer and give zakah and bow with those who bow [in worship].\n44. Do you order righteousness of the people and forget yourselves while you recite the Scripture? Then will you not reason?\n45. And seek help through patience and prayer, and indeed, it is difficult except for the humbly submissive [to Allah]\n46. Who are certain that they will meet their Lord and that they will return to Him.",
                  "arabic_recitation": "https://server.mp3quran.net/afs/002.mp3",
                  "tafseer_audio": "https://example.com/tafsir/6.mp3",
                  "tafseer_video": "https://youtube.com/watch?v=tafsir-baqarah5"
                },
                 {"ruku": 6,
                  "arabic": "٤٧. يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَنِّي فَضَّلْتُكُمْ عَلَى الْعَالَمِينَ\n٤٨. وَاتَّقُوا يَوْمًا لَّا تَجْزِي نَفْسٌ عَن نَّفْسٍ شَيْئًا وَلَا يُقْبَلُ مِنْهَا شَفَاعَةٌ وَلَا يُؤْخَذُ مِنْهَا عَدْلٌ وَلَا هُمْ يُنصَرُونَ\n٤٩. وَإِذْ نَجَّيْنَاكُم مِّنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ يُذَبِّحُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ وَفِي ذَٰلِكُم بَلَاءٌ مِّن رَّبِّكُمْ عَظِيمٌ\n٥٠. وَإِذْ فَرَقْنَا بِكُمُ الْبَحْرَ فَأَنجَيْنَاكُمْ وَأَغْرَقْنَا آلَ فِرْعَوْنَ وَأَنتُمْ تَنظُرُونَ\n٥١. وَإِذْ وَاعَدْنَا مُوسَىٰ أَرْبَعِينَ لَيْلَةً ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِن بَعْدِهِ وَأَنتُمْ ظَالِمُونَ\n٥٢. ثُمَّ عَفَوْنَا عَنكُم مِّن بَعْدِ ذَٰلِكَ لَعَلَّكُمْ تَشْكُرُونَ\n٥٣. وَإِذْ آتَيْنَا مُوسَى الْكِتَابَ وَالْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُونَ\n٥٤. وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِاتِّخَاذِكُمُ الْعِجْلَ فَتُوبُوا إِلَىٰ بَارِئِكُمْ فَاقْتُلُوا أَنفُسَكُمْ ذَٰلِكُمْ خَيْرٌ لَّكُمْ عِندَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ\n٥٥. وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَن نُّؤْمِنَ لَكَ حَتَّىٰ نَرَى اللَّهَ جَهْرَةً فَأَخَذَتْكُمُ الصَّاعِقَةُ وَأَنتُمْ تَنظُرُونَ\n٥٦. ثُمَّ بَعَثْنَاكُم مِّن بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ\n٥٧. وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ وَأَنزَلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوَىٰ كُلُوا مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوا أَنفُسَهُمْ يَظْلِمُونَ\n٥٨. وَإِذْ قُلْنَا ادْخُلُوا هَٰذِهِ الْقَرْيَةَ فَكُلُوا مِنْهَا حَيْثُ شِئْتُمْ رَغَدًا وَادْخُلُوا الْبَابَ سُجَّدًا وَقُولُوا حِطَّةٌ نَّغْفِرْ لَكُمْ خَطَايَاكُمْ وَسَنَزِيدُ الْمُحْسِنِينَ\n٥٩. فَبَدَّلَ الَّذِينَ ظَلَمُوا قَوْلًا غَيْرَ الَّذِي قِيلَ لَهُمْ فَأَنزَلْنَا عَلَى الَّذِينَ ظَلَمُوا رِجْزًا مِّنَ السَّمَاءِ بِمَا كَانُوا يَفْسُقُونَ",
                  "translation": "47. O Children of Israel, remember My favor that I have bestowed upon you and that I preferred you over the worlds.\n48. And fear a Day when no soul will suffice for another soul at all, nor will intercession be accepted from it, nor will compensation be taken from it, nor will they be aided.\n49. And [recall] when We saved you from the people of Pharaoh, who afflicted you with the worst torment, slaughtering your sons and keeping your women alive. And in that was a great trial from your Lord.\n50. And [recall] when We parted the sea for you and saved you and drowned the people of Pharaoh while you were looking on.\n51. And [recall] when We made an appointment with Moses for forty nights, then you took the calf after him and you were wrongdoers.\n52. Then We forgave you after that so perhaps you would be grateful.\n53. And [recall] when We gave Moses the Scripture and criterion that perhaps you would be guided.\n54. And [recall] when Moses said to his people, \"O my people, indeed you have wronged yourselves by your taking of the calf [for worship]. So repent to your Creator and kill yourselves. That is best for [all of] you in the sight of your Creator.\" Then He accepted your repentance; indeed, He is the Accepting of repentance, the Merciful.\n55. And [recall] when you said, \"O Moses, we will never believe you until we see Allah outright;\" so the thunderbolt took you while you were looking on.\n56. Then We revived you after your death that perhaps you would be grateful.\n57. And We shaded you with clouds and sent down to you manna and quails, [saying], \"Eat from the good things with which We have provided you.\" And they wronged Us not - but they were [only] wronging themselves.\n58. And [recall] when We said, \"Enter this city and eat from it wherever you will in [ease and] abundance and enter the gate bowing humbly and say, 'Relieve us of our burdens.' We will then forgive your sins for you, and We will increase the doers of good [in goodness and reward].\"\n59. But those who wronged changed [those words] to a statement other than that which had been said to them, so We sent down upon those who wronged a punishment from the sky because they were defiantly disobedient.",
                  "arabic_recitation": "https://server.mp3quran.net/afs/002.mp3",
                  "tafseer_audio": "https://example.com/tafsir/7.mp3",
                  "tafseer_video": "https://youtube.com/watch?v=tafsir-baqarah6"
                },
                { "ruku": 7,
                  "arabic": "٦٠. وَإِذِ اسْتَسْقَىٰ مُوسَىٰ لِقَوْمِهِ فَقُلْنَا اضْرِب بِّعَصَاكَ الْحَجَرَ فَانفَجَرَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا قَدْ عَلِمَ كُلُّ أُنَاسٍ مَّشْرَبَهُمْ كُلُوا وَاشْرَبُوا مِن رِّزْقِ اللَّهِ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ\n٦١. وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍ وَاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنبِتُ الْأَرْضُ مِنۢ بَقْلِهَا وَقِثَّآئِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا قَالَ أَتَسْتَبْدِلُونَ الَّذِي هُوَ أَدْنَىٰ بِالَّذِي هُوَ خَيْرٌ ٱهْبِطُوا مِصْرًا فَإِنَّ لَكُم مَّا سَأَلْتُمْ وَضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ وَالْمَسْكَنَةُ وَبَآءُو بِغَضَبٍ مِّنَ اللَّهِ ذَٰلِكَ بِأَنَّهُمْ كَانُوا يَكْفُرُونَ بِآيَاتِ اللَّهِ وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ الْحَقِّ ذَٰلِكَ بِمَا عَصَوا وَّكَانُوا يَعْتَدُونَ",
                  "translation": "60. And [recall] when Moses prayed for water for his people, so We said, 'Strike the stone with your staff.' Then there gushed forth from it twelve springs, and every people knew its watering place. 'Eat and drink from Allah's provision and do not commit abuse on the earth, spreading corruption.'\n61. And [recall] when you said, 'O Moses, we can never endure one [kind of] food. So call upon your Lord to bring forth for us from the earth its green herbs and its cucumbers and its garlic and its lentils and its onions.' [Moses] said, 'Would you exchange what is better for what is less? Go into [any] settlement and indeed, you will have what you have asked.' And they were covered with humiliation and poverty and returned with anger from Allah [upon them]. That was because they [repeatedly] disbelieved in the signs of Allah and killed the prophets without right. That was because they disobeyed and were [habitually] transgressing.",
                  "arabic_recitation": "https://server.mp3quran.net/afs/002.mp3",
                  "tafseer_audio": "https://example.com/tafsir/8.mp3",
                  "tafseer_video": "https://youtube.com/watch?v=tafsir-baqarah7"
                },
                { "ruku": 8,
                  "arabic": "٦٢. إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالنَّصَارَىٰ وَالصَّابِئِينَ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَعَمِلَ صَالِحًا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ\n٦٣. وَإِذْ أَخَذْنَا مِيثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّورَ خُذُوا مَا آتَيْنَاكُم بِقُوَّةٍ وَاذْكُرُوا مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ\n٦٤. ثُمَّ تَوَلَّيْتُم مِّن بَعْدِ ذَٰلِكَ فَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لَكُنتُم مِّنَ الْخَاسِرِينَ\n٦٥. وَلَقَدْ عَلِمْتُمُ الَّذِينَ اعْتَدَوْا مِنكُمْ فِي السَّبْتِ فَقُلْنَا لَهُمْ كُونُوا قِرَدَةً خَاسِئِينَ\n٦٦. فَجَعَلْنَاهَا نَكَالًا لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةً لِّلْمُتَّقِينَ\n٦٧. وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ إِنَّ اللَّهَ يَأْمُرُكُمْ أَن تَذْبَحُوا بَقَرَةً قَالُوا أَتَتَّخِذُنَا هُزُوًا قَالَ أَعُوذُ بِاللَّهِ أَنْ أَكُونَ مِنَ الْجَاهِلِينَ\n٦٨. قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَلَا بِكْرٌ عَوَانٌ بَيْنَ ذَٰلِكَ فَافْعَلُوا مَا تُؤْمَرُونَ\n٦٩. قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ صَفْرَاءُ فَاقِعٌ لَّوْنُهَا تَسُرُّ النَّاظِرِينَ\n٧٠. قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ إِنَّ الْبَقَرَ تَشَابَهَ عَلَيْنَا وَإِنَّا إِن شَاءَ اللَّهُ لَمُهْتَدُونَ\n٧١. قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لَّا ذَلُولٌ تُثِيرُ الْأَرْضَ وَلَا تَسْقِي الْحَرْثَ مُسَلَّمَةٌ لَّا شِيَةَ فِيهَا قَالُوا الْآنَ جِئْتَ بِالْحَقِّ فَذَبَحُوهَا وَمَا كَادُوا يَفْعَلُونَ",
                  "translation": "62. Indeed, those who believed and those who were Jews or Christians or Sabeans – those [among them] who believed in Allah and the Last Day and did righteousness – will have their reward with their Lord, and no fear will there be concerning them, nor will they grieve.\n63. And [recall] when We took your covenant and raised over you the Mount [saying], 'Take what We have given you with determination and remember what is in it that perhaps you may become righteous.'\n64. Then you turned away after that. And if not for the favor of Allah upon you and His mercy, you would have been among the losers.\n65. And you had already known about those who transgressed among you concerning the sabbath, and We said to them, 'Be apes, despised.'\n66. So We made it a deterrent punishment for those who were present and those who succeeded [them] and a lesson for those who fear Allah.\n67. And [recall] when Moses said to his people, 'Indeed, Allah commands you to slaughter a cow.' They said, 'Do you take us in ridicule?' He said, 'I seek refuge in Allah from being among the ignorant.'\n68. They said, 'Call upon your Lord to make clear to us what it is.' [Moses] said, 'He says, It is a cow which is neither old nor virgin, but median between that, so do what you are commanded.'\n69. They said, 'Call upon your Lord to show us what is her color.' He said, 'He says, It is a yellow cow, bright in color – pleasing to the observers.'\n70. They said, 'Call upon your Lord to make clear to us what it is. Indeed, [all] cows look alike to us. And indeed we, if Allah wills, will be guided.'\n71. He said, 'He says, It is a cow neither trained to plow the earth nor to irrigate the field, one free from fault with no spot upon her.' They said, 'Now you have come with the truth.' So they slaughtered her, but they could hardly do it.",
                  "arabic_recitation": "https://server.mp3quran.net/afs/002.mp3",
                  "tafseer_audio": "https://example.com/tafsir/9.mp3",
                  "tafseer_video": "https://youtube.com/watch?v=tafsir-baqarah8"
                },
                { "ruku": 9,
                  "arabic": "٧٢. وَإِذْ قَتَلْتُمْ نَفْسًا فَادَّارَأْتُمْ فِيهَا وَاللَّهُ مُخْرِجٌ مَّا كُنتُمْ تَكْتُمُونَ\n٧٣. فَقُلْنَا اضْرِبُوهُ بِبَعْضِهَا كَذَٰلِكَ يُحْيِي اللَّهُ الْمَوْتَىٰ وَيُرِيكُمْ آيَاتِهِ لَعَلَّكُمْ تَعْقِلُونَ\n٧٤. ثُمَّ قَسَتْ قُلُوبُكُم مِّن بَعْدِ ذَٰلِكَ فَهِيَ كَالْحِجَارَةِ أَوْ أَشَدُّ قَسْوَةً وَإِنَّ مِنَ الْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ الْأَنْهَارُ وَإِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ الْمَاءُ وَإِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْيَةِ اللَّهِ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ\n٧٥. أَفَتَطْمَعُونَ أَن يُؤْمِنُوا لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلَامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ مِن بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ\n٧٦. وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَا بَعْضُهُمْ إِلَىٰ بَعْضٍ قَالُوا أَتُحَدِّثُونَهُم بِمَا فَتَحَ اللَّهُ عَلَيْكُمْ لِيُحَاجُّوكُم بِهِ عِندَ رَبِّكُمْ أَفَلَا تَعْقِلُونَ\n٧٧. أَوَلَا يَعْلَمُونَ أَنَّ اللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ\n٧٨. وَمِنْهُمْ أُمِّيُّونَ لَا يَعْلَمُونَ الْكِتَابَ إِلَّا أَمَانِيَّ وَإِنْ هُمْ إِلَّا يَظُنُّونَ\n٧٩. فَوَيْلٌ لِّلَّذِينَ يَكْتُبُونَ الْكِتَابَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هَٰذَا مِنْ عِندِ اللَّهِ لِيَشْتَرُوا بِهِ ثَمَنًا قَلِيلًا فَوَيْلٌ لَّهُم مِّمَّا كَتَبَتْ أَيْدِيهِمْ وَوَيْلٌ لَّهُم مِّمَّا يَكْسِبُونَ\n٨٠. وَقَالُوا لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَةً قُلْ أَتَّخَذْتُمْ عِندَ اللَّهِ عَهْدًا فَلَن يُخْلِفَ اللَّهُ عَهْدَهُ أَمْ تَقُولُونَ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ\n٨١. بَلَىٰ مَن كَسَبَ سَيِّئَةً وَأَحَاطَتْ بِهِ خَطِيئَتُهُ فَأُو۟لَٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ هُمْ فِيهَا خَـٰلِدُونَ\n٨٢. وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُو۟لَٰٓئِكَ أَصْحَـٰبُ الْجَنَّةِ هُمْ فِيهَا خَـٰلِدُونَ",
                  "translation": "72. And [recall] when you killed a man and disputed over it, but Allah was to bring out that which you were concealing.\n73. So We said, 'Strike him with part of it.' Thus does Allah bring the dead to life, and He shows you His signs that you might reason.\n74. Then your hearts became hardened after that, being like stones or even harder. For indeed, there are stones from which rivers burst forth, and there are some of them that split open and water comes out, and there are some of them that fall down for fear of Allah. And Allah is not unaware of what you do.\n75. Do you covet [the hope, O believers], that they would believe for you while a party of them used to hear the words of Allah and then distort the Torah after they had understood it while they were knowing?\n76. And when they meet those who believe, they say, 'We have believed'; but when they are alone with one another, they say, 'Do you talk to them about what Allah has revealed to you so they can argue with you about it before your Lord? Then will you not reason?'\n77. But do they not know that Allah knows what they conceal and what they declare?\n78. And among them are unlettered ones who do not know the Scripture except in wishful thinking, but they are only assuming.\n79. So woe to those who write the Scripture with their own hands, then say, 'This is from Allah,' in order to exchange it for a small price. Woe to them for what their hands have written, and woe to them for what they earn.\n80. And they say, 'Never will the Fire touch us, except for [a few] numbered days.' Say, 'Have you taken a covenant with Allah? For Allah will never break His covenant. Or do you say about Allah that which you do not know?'\n81. Yes, [on the contrary], whoever earns evil and his sin has encompassed him - those are the companions of the Fire; they will abide therein eternally.\n82. But they who believe and do righteous deeds - those are the companions of Paradise; they will abide therein eternally.",
                  "arabic_recitation": "https://server.mp3quran.net/afs/002.mp3",
                  "tafseer_audio": "https://example.com/tafsir/10.mp3",
                  "tafseer_video": "https://youtube.com/watch?v=tafsir-baqarah9"
                }
        ]
    }
  ]